content-org/all-posts.org
#+title: Hammond's Blog And Class Posts
#+hugo_base_dir: ../
#+MACRO: more @@hugo:<!--more-->@@
#   to use this one, write {{{more}}}
#+MACRO: youtube @@hugo:{{< youtube id="$1" >}}@@
#  to use this, write {{{youtube(ID)}}}
#+hugo_paired_shortcodes: spoiler
#  to use this, write:
#     #+begin_spoiler
#      You need to click to see this, my friend.
#     #+end_spoiler

** Week 1
:PROPERTIES:
:EXPORT_FILE_NAME: Week1
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :ShowBreadCrumbs true
:END:

Your todo list for the week
{{{more}}}

*** Before class on Tuesday
:PROPERTIES:
:CUSTOM_ID: before-class-on-tuesday
:END:
Review the syllabus and come prepared to learn about "what in the world
is this class and how does it work?"

--------------

*** 🎥 Tuesday recitation
:PROPERTIES:
:CUSTOM_ID: tuesday-recitation
:END:

So... the projector wasn't working for the first fifteen-twenty minutes of the class, but it got fixed. I trimmed out the uncomfortable "this isn't working" part of the class.

{{{youtube(XXDdNG0lnLk)}}}

--------------

*** Sample checkpoint is available.
[[https://discourse.math.wichita.edu/t/sample-checkpoint-1-and-solutions/1108][You can find information about the sample checkpoint along with solutions here.]]

*** Before Class on Thursday
:PROPERTIES:
:CUSTOM_ID: before-class-on-thursday
:END:
**** 📚 Readings / Videos
:PROPERTIES:
:CUSTOM_ID: readings-videos
:END:

- [[https://www.math.wichita.edu/~hammond/class-notes/section-prop-logic.html][Propositional Logic]]
- [[https://www.math.wichita.edu/~hammond/class-notes/sec_objects_sets.html][Sets]]

If you have any questions at any time - click reply at the bottom of the
page and ask! I'll be quick to answer!

**** 📝 Homework
:PROPERTIES:
:CUSTOM_ID: homework
:END:
- Required: Do all the exercises at the bottom of each section, check
  your answers and check your understanding - please ask questions if
  you're unsure!
- (optional): Practice additional exercises in the supplemental textbooks if you need/want: [[http://discrete.openmathbooks.org/dmoi3/][DMOI]] and [[http://faculty.uml.edu/klevasseur/ads/index-ads.html][Applied Discrete Structures]].

**** Assessments this week
:PROPERTIES:
:CUSTOM_ID: assessments-this-week
:END:
- The weekly Checkpoint Quiz will be available Thursday - Sunday. It
  assesses standards O1, O2, and O3.
- *REMEMBER* ! [[https://discourse.math.wichita.edu/t/sample-checkpoint-1-and-solutions/1108][A sample checkpoint is available]]!
  I highly recommend you practice it as you're studying to get some experience.
- For more information about uploading, [[https://discourse.math.wichita.edu/t/uploading-weekly-checkpoints-to-nextcloud/1113][see here]].

*An announcement will be posted on Blackboard with a link when it's
available* !

--------------

*** 🎥 Thursday recitation
:PROPERTIES:
:CUSTOM_ID: thursday-recitation
:END:
{{{youtube(jtwVx9UCR4o)}}}


