content/math321/Week1.md
+++
title = "Week 1"
author = ["John Hammond"]
draft = false
ShowBreadCrumbs = true
+++

Your todo list for the week
<!--more-->


## Before class on Tuesday {#before-class-on-tuesday}

Review the syllabus and come prepared to learn about "what in the world
is this class and how does it work?"

---


## 🎥 Tuesday recitation {#tuesday-recitation}

So... the projector wasn't working for the first fifteen-twenty minutes of the class, but it got fixed. I trimmed out the uncomfortable "this isn't working" part of the class.

{{< youtube id="XXDdNG0lnLk" >}}

---


## Sample checkpoint is available. {#sample-checkpoint-is-available-dot}

[You can find information about the sample checkpoint along with solutions here.](https://discourse.math.wichita.edu/t/sample-checkpoint-1-and-solutions/1108)


## Before Class on Thursday {#before-class-on-thursday}


### 📚 Readings / Videos {#readings-videos}

-   [Propositional Logic](https://www.math.wichita.edu/~hammond/class-notes/section-prop-logic.html)
-   [Sets](https://www.math.wichita.edu/~hammond/class-notes/sec_objects_sets.html)

If you have any questions at any time - click reply at the bottom of the
page and ask! I'll be quick to answer!


### 📝 Homework {#homework}

-   Required: Do all the exercises at the bottom of each section, check
    your answers and check your understanding - please ask questions if
    you're unsure!
-   (optional): Practice additional exercises in the supplemental textbooks if you need/want: [DMOI](http://discrete.openmathbooks.org/dmoi3/) and [Applied Discrete Structures](http://faculty.uml.edu/klevasseur/ads/index-ads.html).


### Assessments this week {#assessments-this-week}

-   The weekly Checkpoint Quiz will be available Thursday - Sunday. It
    assesses standards O1, O2, and O3.
-   **REMEMBER** ! [A sample checkpoint is available](https://discourse.math.wichita.edu/t/sample-checkpoint-1-and-solutions/1108)!
    I highly recommend you practice it as you're studying to get some experience.
-   For more information about uploading, [see here](https://discourse.math.wichita.edu/t/uploading-weekly-checkpoints-to-nextcloud/1113).

**An announcement will be posted on Blackboard with a link when it's
available** !

---


## 🎥 Thursday recitation {#thursday-recitation}

{{< youtube id="jtwVx9UCR4o" >}}
